Revit 2027 API
ViewCropRegionShapeManager.GetCropShape Method
 Gets the crop boundaries that are curently active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetCropShape()
Public Function GetCropShape As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetCropShape()
member GetCropShape : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The crop boundaries.
Remarks
 This method returns a representation of the boundaries of the currently active crop for the associated view. If the view crop has a non-rectangular shape, the method returns that shape. Otherwise, if the view crop has been split, the method returns the multiple rectangular boundaries visible in the crop - note that this does not reflect any offsets that may have been applied to the boundary regions. If the crop is not split, this returns a single rectangle representing the crop. All coordinates are in the coordinate frame of the view.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace